Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: We will talk more about the runtime configuration in Section 51.5, “More about project libraries”.
zh_cn: 我们将在 51.5 节，“详谈项目库”中更多地对runtime配置进行讨论。

source: Web Application Quickstart
zh_cn: Web 应用程序快速入门

source: Web application sources
zh_cn: Web 应用程序源代码

source: Weeks later there is an exception on the integration machine which can't be reproduced on anyone's machine.
zh_cn: 一周后在集成的机器上可能会有一个异常，而这个异常无法在任何人的机器上复现。

source: What exactly the Eclipse plugin generates depends on which other plugins are used:
zh_cn: Eclipse 插件生成的内容完全取决于使用了哪些其他的插件：

source: What exactly the IDEA plugin generates depends on which other plugins are used:
zh_cn: IDEA 插件生成的内容完全取决于使用了哪些其他的插件：

source: What if one projects needs the jar produced by another project in its compile path?
zh_cn: 可能会出现，一个项目在它的编译路径中需要由另一个项目所输出的jar包？

source: What is dependency management?
zh_cn: 什么是依赖管理？

source: What is the purpose of this behavior?
zh_cn: 这种行为的目的是什么？

source: What plugins do
zh_cn: 插件都做了什么

source: When scalaCompileOptions.fork is set to true, compilation will take place in an external process.
zh_cn: 当scalaCompileOptions.fork设置为true时，编译会在外部进程中进行。

source: When Gradle executes a script, it compiles the script into a class which implements Script.
zh_cn: 当 Gradle 执行一个脚本时，它将脚本编译为一个实现了Script接口的类。

source: When Gradle is executed without the daemon, then a new JVM must be launched for every build execution, unless the JVM launched by the Gradle start script happens to have the same parameters.
zh_cn: 当不通过守护进程执行 Gradle 时，在每次构建执行中都必须启动一个新的 JVM ，除非 JVM 是由 Gradle 启动脚本启动的，并且恰好具有相同的参数。

source: When a build's dependency tree becomes unwieldy, your build tool shouldn't force you to adopt a single, inflexible approach to dependency management.
zh_cn: 当一个构建的依赖树变得笨拙时，你的构建工具不应该强迫你对依赖管理采取单一、不灵活的做法。

source: When a platform does not define an architecture or operating system, the default target of the tool chain is assumed.
zh_cn: 当一个平台并没有定义一个架构或操作系统时，会被认为使用默认的工具链目标。

source: When a set of build types, target platforms, and flavors is defined for a component, a NativeBinary model element is created for every possible combination of these.
zh_cn: 当为一个组件定义了一组构建类型，目标平台，以及flavor时，将会为它们的每一种可能的组合创建一个NativeBinary 模型元素。

source: When an argument resolves to a directory, everything under that directory (but not the directory itself) is recursively copied into the destination directory.
zh_cn: 当参数解析为一个目录时，该目录下的所有文件（不包含目录本身） 都会递归复制到目标目录。

source: When an argument resolves to a file, that file is copied into the destination directory.
zh_cn: 当参数解析为一个文件时，该文件会复制到目标目录中。

source: When an argument resolves to a non-existing file, that argument is ignored.
zh_cn: 当参数解析为一个不存在的文件时，参数会被忽略。

source: When analyzing a project hierarchy, values set via system properties apply to the root project of the analyzed hierarchy.
zh_cn: 当分析项目的层次结构时，通过系统属性设置的值应用于所分析层次结构的根项目。

source: When compiling the 'french' variant, a separate macro is defined which leads to a different binary being produced.
zh_cn: 当编译“french”变种时，会定义一个单独的宏，以产生不同的二进制文件。

source: When configured, Gradle will run in incubating parallel mode.
zh_cn: 如果配置了这一个，Gradle 将在孵化的并行模式下运行。

source: When creating the simple task, you have to set the overwrite property to true.
zh_cn: 当创建这个简单的任务时，您必须将overwrite属性设置为 true。

source: When defining an exclude, you can specify either only the organization or only the module name or both.
zh_cn: 在定义一个 exclude 时，你可以只指定 organization 或者 module 名称，或者是两者都指定。

source: When deploying an artifact to a Maven repository, Gradle automatically generates a POM for it.
zh_cn: 当部署一个artifact 到一个 Maven 库时，Gradle 会自动为它生成一个POM。

source: When deploying signatures for your artifacts to a Maven repository, you will also want to sign the published POM file.
zh_cn: 当为你的artifacts部署签名到 Maven 仓库时，你还想签名发布的 POM 文件。

source: When developing a web application, where the application is assembled many times.
zh_cn: 当开发一个 web 应用程序中，应用程序会被组装多次。

source: When discovering what a build can do, where gradle tasks is executed a number of times.
zh_cn: 当发现构建能做什么，在gradle tasks在哪里会执行多次。

source: When evaluated, the closure is passed the task whose dependencies are being calculated.
zh_cn: 在计算依赖时，闭包会被传入正在计算依赖的任务。

source: When it executes, it copies the source files into the destination directory, and then removes any files from the destination directory which it did not copy.
zh_cn: 当它执行时，它会将源文件复制到目标目录中，然后从目标目录移除所有不是它复制的文件。

source: When run with --continue, it is possible for B to execute in the event that A fails.
zh_cn: 当--continue参数运行时，可能会是A执行失败后B执行了。

source: When running with offline, Gradle will never attempt to access the network to perform dependency resolution.
zh_cn: 在使用离线运行时，Gradle 将不会尝试访问网络来执行依赖解析。

source: When running with the daemon, a JVM with the correct parameters is started once and reused for each daemon build execution.
zh_cn: 当通过守护进程运行时，带有正确参数的 JVM 会启动一次，并在每次的守护进程构建执行时复用。

source: When set to true the Gradle daemon is to run the build.
zh_cn: 当设置为true 时，Gradle 守护进程会运行构建。

source: When setting only a single property at a time, the equivalent property syntax is more succinct:
zh_cn: 当一次只设置一个属性时，等效属性的语法更加简洁：

source: When signing is not required and the POM cannot be signed due to insufficient configuration (i.e. no credentials for signing) then the signPom() method will silently do nothing.
zh_cn: 当不需要签名，以及由于缺少配置（即没有签名证书）而不能签名 POM 的时候，signPom()方法将什么都不会做，并且不会进行任何的提示。

source: When specifying what is to be signed via the Signing DSL, the resultant signature artifacts are automatically added to the signatures and archives dependency configurations.
zh_cn: 当通过 Signing DSL指定什么要被签名的时候，生成的signature会自动地加入到 signatures 和 archives 的依赖配置中。

source: When the visual-studio plugin is applied, a task name ${component.name}VisualStudio is created for each defined component.
zh_cn: 当应用 visual-studio 插件后，会为每一个定义的组件创建一个名为 ${component.name}VisualStudio 的任务。

source: When the Eclipse plugin encounters a Scala project, it adds additional configuration to make the project work with Scala IDE out of the box.
zh_cn: 当 Eclipse 插件遇到 Scala 项目时，它将添加额外的配置，使得项目能够在使用 Scala IDE 时开箱即用。

source: When the IDEA plugin encounters a Scala project, it adds additional configuration to make the project work with IDEA out of the box.
zh_cn: 当 IDEA 插件遇到 Scala 项目时，它将添加额外的配置，使得项目能够在使用 IDEA 时开箱即用。

source: When the archive is generated, a corresponding MANIFEST.MF file is written into the archive.
zh_cn: 当生成archive时，相应的MANIFEST.MF文件也会被写入进去。

source: When the command line option is used, the inclusion filters declared in the build script are ignored.
zh_cn: 当使用该命令行选项选项时，在构建脚本中声明的列入过滤器的测试将会被忽略。

source: When the dependency is declared by a static version and a module descriptor file is found in a repository, there is no need to continue searching later repositories and the remainder of the process is short-circuited.
zh_cn: 当依赖由一个静态版本来声明，并且在仓库中找到模块描述符文件时，将不会再继续搜索后面的仓库，这个过程的其余部分是短路的。

source: When the last parameter of a method is a closure, you can place the closure after the method call:
zh_cn: 当方法的最后一个参数是一个闭包时，你可以把闭包放在方法调用之后：

source: When these large dependency trees need to change, you'll often have to solve some dependency version conflicts.
zh_cn: 当这些大的依赖树需要更改时，你经常得解决一些依赖的版本冲突。

source: When using JUnit, we scan for both JUnit 3 and 4 test classes.
zh_cn: 当使用 JUnit 时，我们扫描 JUnit 3 和 4 的测试类。

source: When using TestNG, we scan for methods annotated with @Test.
zh_cn: 当使用 TestNG 时，我们扫描所有带有@Test注解的方法。

source: When using test driven development, where the unit tests are executed many times.
zh_cn: 当使用测试驱动开发时，单元测试会被执行多次。

source: When using the VisualCpp tool chain, Gradle is able to compile Window Resource (rc) files and link them into a native binary.
zh_cn: 当使用VisualCpp工具链时，Gradle 时能够编译Window Resource (rc) 文件并将它们链接到本地的二进制文件。

source: When we have executed the hello task from the root project dir things behaved in an intuitive way.
zh_cn: 当我们从根项目的目录执行了hello任务时，事情会以一种直观的方式来表现。

source: When you declare an enhanced task, you specify the type, or class of the task.
zh_cn: 当你定义一个增强型任务时，你要定义这个任务的类型或者是类。

source: When you define a new source set, the Java plugin adds some dependency configurations for the source set, as shown in Table 23.6, “Java plugin - source set dependency configurations”.
zh_cn: 当您定义一个新的源集时，Java 插件会为该源集添加一些依赖配置，如表 23.6，“Java 插件 - 源集依赖项配置”所示。

source: When you import an Ant build, each Ant target is treated as a Gradle task.
zh_cn: 当您导入一个 Ant 构建时，每个 Ant 目标被视为一个 Gradle 任务。

source: When you register a logger, only the logging for the interfaces that it implements is replaced.
zh_cn: 当你注册一个logger时，只能替换它实现的接口的日志记录。

source: When you resolve a changing module, the artifacts are named using the version you requested, but the underlying artifacts may change over time.
zh_cn: 当你解析一个变化模块时，这个 artifacts 使用你请求的版本进行命名，但下层的 artifacts 可能随时会有变化。

source: When you set archiveTask.baseName to a value other than the default, make sure to set uploadTask.repositories.mavenDeployer.pom.artifactId to the same value.
zh_cn: 当你将archiveTask.baseName设置为非默认值时，请确保将uploadTask.repositories.mavenDeployer.pom.artifactId设置为相同的值。

source: Where does this method come from?
zh_cn: 这方法从何而来？

source: Where to next?
zh_cn: 下一步目标？

source: Which libraries depend on the protocol you need.
zh_cn: 具体是哪些库，将取决于你需要的协议。

source: While Gradle has strong opinions on dependency management, the tool gives you a choice between two options: follow recommended best practices or support any kind of pattern you can think of.
zh_cn: 由于 Gradle 对依赖管理有强烈的主张，该工具使你可以选择两个选项之间：遵循推荐的最佳实践或支持任何你能想到的类型的模式。

source: While Maven provides a complete build system, Ivy focuses solely on dependency management.
zh_cn: Maven 提供了一个完整的构建系统，而 Ivy 则完全着眼于依赖管理。

source: While all tasks of type Test are automatically enhanced to provide coverage information when the java plugin has been applied, any task that implements JavaForkOptions can be enhanced by the JaCoCo plugin.
zh_cn: 虽然Test的所有任务会在java插件被配置使用时会自动增强以提供覆盖率信息，但是任何实现了JavaForkOptions的任务都可以通过 JaCoCo 插件得到增强。

source: While certainly useful at times, we do recommend to keep the bulk of the configuration in a (versioned) build script, readily available to everyone.
zh_cn: 虽然有时当然很有用，但我们建议在 （版本控制的）构建脚本中，能够方便地让每个人都保持大部分的配置。

source: While it's possible to configure these in your local environment via GRADLE_OPTS or JAVA_OPTS, certain settings like JVM memory settings, Java home, daemon on/off can be more useful if they can versioned with the project in your VCS so that the entire team can work with consistent environment.
zh_cn: 当可以通过 GRADLE_OPTS 或 JAVA_OPTS 在你的本地环境中配置这些选项时，如果某些设置如 JVM 内存设置， Java home， 守护进程的开/关，它们可以和你的项目在你的版本控制系统中被版本化的话，将会更有用，这样整个团队就可以使用一致的环境了。

source: While many excellent build tools exist for this space of software development, Gradle offers developers it's trademark power and flexibility together with the dependency management practices more traditionally found in the JVM development space.
zh_cn: 虽然对于这种软件开发的空间，已经有许多优秀的构建工具存在，但是Gradle 向开发人员提供的是它的强大特征和灵活性，以及在依赖管理实践上，在JVM开发空间上更为传统的发现。

source: While parallel execution does not strictly require decoupling at configuration time, the long-term goal is to provide a powerful set of features that will be available for fully decoupled projects.
zh_cn: 而并行执行并不严格要求在配置时解耦，它的长期目标是提供一套强大的可用于全解耦的项目的功能。

source: While the c plugin defines these default locations for each CSourceSet, it is possible to extend or override these defaults to allow for a different project layout.
zh_cn: 而c插件为每个CSourceSet定义了这些默认的位置，且可以扩展或重写这些默认值使能够成为不同的项目布局。

source: While the cpp plugin defines these default locations for each CppSourceSet, it is possible to extend or override these defaults to allow for a different project layout.
zh_cn: 而cpp插件为每个CppSourceSet定义了这些默认的位置，且可以扩展或重写这些默认值使能够成为不同的项目布局。

source: While the build type and target platform variant dimensions have a defined meaning in Gradle, each project is free to define any number of flavors and apply meaning to them in any way.
zh_cn: 在Gradle中 build type 和 target platform 变种维度是有一个确定的定义的，而每一个project都可以自由地定义数量的flavor并且用任何方式去应用它们的意义。

source: While the build continued to work, developers were starting to notice all sorts of surprising (and surprisingly awful) bugs in production.
zh_cn: 虽然可以继续构建，开发者已经开始注意到在生产中出现了各种令人惊讶（和惊人可怕）的 bug。

source: While the strategies introduced above are usually enough to solve most conflicts, Gradle provides more fine-grained mechanisms to resolve version conflicts:
zh_cn: 虽然上面介绍的策略通常足够解决大部分的冲突，但是 Gradle 也提供更细粒度的机制，以解决版本冲突：

source: While the version of a jar is usually in the Manifest file, it isn't readily apparent when you are inspecting a project.
zh_cn: Jar 的版本通常是在清单文件中，当你要检查一个项目时它并不显而易见。

source: While this new mechanism is incubating and not yet complete, it introduces some new concepts and features that do (and will) make Gradle publishing even more powerful.
zh_cn: 这种新机制现在还在孵化中而尚未完成，它引入了一些新的概念和特性，它们将使 Gradle 的发布功能更强大。

source: While this provides a great deal of power and flexibility to the build author, it also limits the flexibility that Gradle has when building those projects.
zh_cn: 虽然这能为构建作者提供强大的功能和灵活性，但它也限制了在构建这些项目时Gradle 的灵活性。

source: While you are working in a typical development cycle repeatedly building and testing changes to the :api project (knowing that you are only changing files in this one project), you may not want to even suffer the expense of :shared:compile checking to see what has changed in the :shared project.
zh_cn: 当你在进行一个典型的开发周期的构建，或者是测试:api项目的修改（要知道你只修改了一个项目的文件），你可能不想经历:shared:compile 花费检查来看在:shared项目里修改了什么内容。

source: While you could try to manage this problem manually, you will quickly find that this approach doesn't scale.
zh_cn: 虽然你可以尝试手动管理这个问题，你很快就会发现这种方法不能扩展。

source: Why Groovy?
zh_cn: 为什么使用 Groovy?

source: Why are you using the Java plugin?
zh_cn: 为什么要用 Java 插件？

source: Wildcard '*' is supported for matching any characters
zh_cn: 通配符 “*” 支付匹配任何字符

source: Windows XP and later, Visual C++ 2010 and later.
zh_cn: Windows XP及以上，Visual C++ 2010 及以上版本。

source: Windows XP and later, using GCC distributed with Cygwin.
zh_cn: Windows XP及以上，使用Cygwin的GCC。

source: Windows XP and later.
zh_cn: Windows XP 及以上。

source: Windows resources to be included in a native binary are provided via a WindowsResourceSet, which defines a set of Windows Resource source files.
zh_cn: 将 Windows 资源包含进本机二进制文件中，是通过一个WindowsResourceSet提供的，它定义了一组Windows Resource源文件。

source: With Gradle or Ivy, the case is different.
zh_cn: 而使用 Gradle 或Ivy的话，情况就不同了。

source: With Gradle you can deploy to remote Maven repositories or install to your local Maven repository.
zh_cn: 通过 Gradle你可以部署到远程 Maven 仓库，或者是安装到你的本地 Maven 仓库。

source: With Gradle you can mix and match approaches; for example, you could store your jars in an SCM without XML descriptor files and still use transitive dependency management.
zh_cn: 通过 Gradle 你可以混合使用和适配一些方法；例如，你可以在 SCM 中存储你的 jar 包，而不需要 XML 描述符文件，并且仍然使用传递依赖管理。

source: With Gradle you just don't configure them via XML but directly via their API.
zh_cn: 通过Gradle，你只是不用通过XML来配置它们，而是通过它们的API。

source: With Gradle, you can adapt your new build to any existing source of dependencies or dependency metadata.
zh_cn: 使用 Gradle，你可以让你的新构建适配任何现有的依赖来源或依赖元数据。

source: With a good conflict reporting tool like Gradle, that information can be used to communicate with the entire organization and standardize on a single version.
zh_cn: 通过一个好的冲突报告工具，像 Gradle，这些信息可以用于与整个组织沟通，并在一个单一的版本上实现标准化。

source: With enhanced tasks, you don't need to implement the task behaviour as you do with simple tasks.
zh_cn: 使用这些增强型的任务，你不需要像使用简单任务一样去实现这个任务的行为。

source: With hundreds of thousands of interdependent open source components each with a range of versions and incompatibilities, dependency management has a habit of causing problems as builds grow in complexity.
zh_cn: 成千上万的开源组件互相依赖，每个组件都有一系列的版本及不兼容性，随着构建变得越来越复杂，依赖管理常常出现各种问题。

source: With more and more CPU cores available on developer desktops and CI servers, it is important that Gradle is able to fully utilise these processing resources.
zh_cn: 随着在开发人员的台式机和CI服务器上，有越来越多的CPU内核可用，Gradle 能够充分利用这些处理资源就很重要。

source: With the -D command line option you can pass a system property to the JVM which runs Gradle.
zh_cn: 从Gradle 启动的 JVM，你可以使用-D命令行选项向它传入一个系统属性。

source: With the gradle.properties files you can also set system properties.
zh_cn: 通过gradle.properties文件，你还可以设置系统属性。

source: With the Zinc based compiler, even Java code will be compiled incrementally.
zh_cn: 使用基于 Zinc 的编译器时，即使是 Java 代码也将会进行增量编译。

source: With the coming releases the API will grow to provide more information about the resolution result.
zh_cn: 在未来的版本，这个API 将提供更多有关解析结果的详细信息。

source: With the help of the Project report plugin (see Chapter 41, The Project Report Plugin) such a report can be created by your build.
zh_cn: 通过使用 Project report 插件（参阅 第 41 章， Project Report 插件），在构建中可以创建一个这样的报告。

source: With the introduction of directory tasks (see Section 14.1, “Directory creation”) this was no longer possible, as the name of the directory task contains the '/' character.
zh_cn: 在引入目录任务（见第 14.1节，“创建目录”）后将不能再这样做，因为目录任务的名称包含/字符。

source: With the map notation you can define all properties.
zh_cn: 而通过使用 map 标记法，你可以定义所有的属性。

source: With these rules present it is still possible to execute taskA without taskB and vice-versa.
zh_cn: 目前使用这些规则仍有可能出现taskA执行而taskB 没有执行，或者taskB执行而taskA 没有执行。

source: With this builder, any element listed in the Maven POM reference can be added.
zh_cn: 通过这个生成器，Maven POM 参考中列出的任何元素都可以被添加进来。

source: Within a project you can address a task of the same project just by its name.
zh_cn: 在一个项目内，你可以通过任务的名称得到同一个项目的任务。

source: Without modifying the build.gradle file, the wrapper plugin can be auto-applied to the rootproject of the current build by running gradle wrapper from the commandline.
zh_cn: 不需要修改build.gradle文件，该 wrapper 插件可以通过从命令行运行gradle wrapper，自动应用到当前构建的 rootproject 。

source: Without this, in the example above, we would have had to reconfigure every object that needs to work with the class files.
zh_cn: 如果没有这一点，在上面的例子中，我们将不得不重新配置需要使用类文件的每个对象。

source: Working With Files
zh_cn: 使用文件

source: Working through problems
zh_cn: 解决问题

source: Working with source sets
zh_cn: 使用source sets

source: Works with
zh_cn: 与什么插件一起使用

source: Worse yet, this unintentional downgrade of Spring introduced several security vulnerabilities into the system, which now required a full security audit throughout the organization.
zh_cn: 然而，更糟糕的是，无意降低版本的 Spring 向系统引入了几个安全漏洞，现在需要在整个组织中进行全面的安全审核。

source: Writing Build Scripts
zh_cn: 编写构建脚本

source: Writing this chapter was pretty exhausting and reading it might have a similar effect.
zh_cn: 写这一章相当耗费精力，可能你想起来也有同样的感受。

source: Writing your own log messages
zh_cn: 编写自己的日志消息

source: Yet Gradle offers complete transitive dependency management.
zh_cn: 然而 Gradle 能提供完整的传递依赖管理。

source: Yet they usually do not contain relevant information for what has gone wrong in your code.)
zh_cn: 然而他们通常不包含你的的代码中哪里错了的相关信息。）

source: Yet, this approach may not be the most efficient in a very large multi-project builds.
zh_cn: 然而，在一个非常大的多项目构建里，这种方法可能不是最有效的。

source: You also might want to refactor some part of the :api project that is used in other projects.
zh_cn: 你也可能想要重构:api 项目中一些被其他项目用到的内容。

source: You are able to construct a resource-only library by providing Windows Resource sources with no other language sources, and configure the linker as appropriate:
zh_cn: 你能够通过提供没有任何其他语言来源的 Windows Resource 源文件，来构造纯资源库，并适当地配置链接器︰

source: You can access Ant types in the same way that you access tasks, using the name of the type as the method name.
zh_cn: 您可以用访问任务同样的方法，把类型名字作为方法名称，访问 Ant 类型。

source: You can access a project property in your build script simply by using its name as you would use a variable.
zh_cn: 当你要使用一个变量时，你可以仅通过其名称在构建脚本中访问一个项目的属性。

source: You can access tasks from any project using the task's path using the tasks.getByPath() method.
zh_cn: 您可以从任何项目中，使用tasks.getByPath()方法获取任务路径并且通过这个路径来访问任务。

source: You can access the source sets of a project using the sourceSets property.
zh_cn: 你可以使用sourceSets属性访问项目的源集。

source: You can achieve this with:
zh_cn: 你可以这样实现：

source: You can add a description to your task.
zh_cn: 你可以向你的任务添加描述。

source: You can add a task which depends on an Ant target:
zh_cn: 您可以添加一个依赖于 Ant 目标的任务：

source: You can add additional files by configuring the Distribution object that is part of the container.
zh_cn: 你可以通过配置作为窗口一部分的 Distribution 对象，来添加额外的文件。

source: You can add specific behavior on top of the common behavior.
zh_cn: 你可以在共同行为上面再添加特定的行为。

source: You can add your own custom configuration or let the existing configurations extend from other configurations.
zh_cn: 你可以添加你自己的自定义配置，或者让现有配置继承自扩展配置。

source: You can also add 2 file collections together using the + operator, or subtract one file collection from another using the - operator.
zh_cn: 您还可以使用+运算符把两个文件集合相加，或使用-运算符减去一个文件集合。

source: You can also add WAR, ZIP and TAR archives to your project.
zh_cn: 您也可以将WAR、 ZIP 和TAG文件添加到您的项目。

source: You can also add a TaskExecutionGraphListener to the TaskExecutionGraph to receive these events.
zh_cn: 你也可以向TaskExecutionGraph添加一个TaskExecutionGraphListener来接收这些事件。

source: You can also add an Action to a TaskContainer to receive these events.
zh_cn: 你还可以向TaskContainer添加一个Action来接收这些事件。

source: You can also add properties directly to your project object via the -P command line option.
zh_cn: 你也可以通过使用-P命令行选项来直接向您的项目对象添加属性。

source: You can also apply the plugin from an init script:
zh_cn: 你还可以从一个 init 脚本应用这个插件：

source: You can also assign collections or arrays of dependency notations to a configuration:
zh_cn: 你也可以向一个配置指定依赖 notations 的集合或数组：

source: You can also configure arbitrary objects using an external script.
zh_cn: 你还可以使用外部脚本配置任意对象

source: You can also copy a configuration.
zh_cn: 你还可以复制配置。

source: You can also create dependsOn relations on rule based tasks:
zh_cn: 你也可以对基于规则的任务创建依赖关系：

source: You can also directly add properties to your project objects using properties files.
zh_cn: 此外，您也可以通过属性文件向您的project对象添加属性。

source: You can also hook into Gradle's logging system from within other classes used in the build (classes from the buildSrc directory for example).
zh_cn: 您也可以在构建脚本中通过其他使用的类 hook 到 Gradle 的日志系统中（例如 buildSrc 目录中的类）。

source: You can also pass collections, iterables, maps and arrays to the files() method.
zh_cn: 你也可以将集合，迭代变量，map和数组传递给files()方法。

source: You can also pass the files() method a closure or a Callable instance.
zh_cn: 你也可以向files()方法传一个闭包或一个Callable实例。

source: You can also specify multiple patterns.
zh_cn: 你还可以指定多个模式。

source: You can also use a TaskExecutionListener to the TaskExecutionGraph to receive these events.
zh_cn: 你也可以对TaskExecutionGraph使用一个TaskExecutionListener来接收这些事件。

source: You can also use a configuration closure when you define a task.
zh_cn: 您也可以在定义一个任务的时候使用一个配置闭包。

source: You can also use a file to define an artifact:
zh_cn: 你也可以使用一个文件来定义构件：

source: You can also use customization options that the Ear task provides, such as from and metaInf.
zh_cn: 你还可以使用Ear任务提供的自定义选项，如from和metaInf。

source: You can also use strings for the task names:
zh_cn: 您还可以使用字符串作为任务名称：

source: You can also use the Project.copy() method to copy files.
zh_cn: 此外，你也可以使用Project.copy()方法来复制文件。

source: You can also use the Ant property task.
zh_cn: 您还可以使用 Ant property 任务。

source: You can also visit the contents of the tree, and select a sub-tree using Ant-style patterns:
zh_cn: 你也可以使用Ant风格的模式来访问文件树的内容或选择一个子树：

source: You can always copy a resolved configuration.
zh_cn: 你可以永远复制一个解析了的配置。

source: You can call the getByPath() method with a task name, or a relative path, or an absolute path.
zh_cn: 你可以用任务名称，相对路径或者是绝对路径作为参数调用getByPath()方法。

source: You can change the cache expiry times in your build using the resolution strategy (see Section 50.9.3, “Fine-tuned control over dependency caching”).
zh_cn: 你可以通过resolution strategy修改你的构建的缓存到期时间（见第 50.9.3 节，“调整控制依赖缓存”）。
